# Agenda, day 2

1. Q&A
2. Data frames -- creating and working with them
3. Adding and removing data in our data frames
4. Useful methods for data frames
5. Boolean / mask indexes and selecting data
6. using `.loc` for retrieving rows, rows/columns
7. Reading data from outside sources
    - CSV, Excel, etc.
  
Download this file, which contains a few items we'll use in the class: https://files.lerner.co.il/data-science-exercise-files.zip

In [1]:
import pandas as pd
from pandas import Series

In [3]:
temps = Series([20, 23, 25, 22, 23], index=list('abcde'))
temps

a    20
b    23
c    25
d    22
e    23
dtype: int64

# Most of the time, we want 2D data!

It's pretty standard to have *tabular* data, which contains 2 dimensions, normally seen as rows and columns.

You want think of each column in a data frame (which is the Pandas 2D data structure) as a series. It will have an index for each element.  Those indexes are shared across all of the columns, and each column has its own name, as well.

In a data frame:

- The rows are labeled with an index
- The columns are labeled with columns (yeah, that's repetitive)

In [4]:
# To create a data frame:
# - we need 2D data -- this could be a list of lists, or a list of dicts, or a dict of lists
#   it could also be a 2D NumPy array
# - we need names for the rows (the index)
# - we need names for the columns

# something simple, using a list of lists

df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]])
df

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120

In [5]:
# let's add names for both our index (the rows) and our columns


df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [6]:
# if I want to retrieve a row, I can use .loc or .iloc, just like with
# a series!

df.loc['a']   # this retrieves row a

x    10
y    20
z    30
Name: a, dtype: int64

Pandas only knows how to handle data in a limited number of ways. If you ask for one value, you'll get that value. But if you ask for a number of values in 1D, you'll get a series. (That's what we got here.) If you ask for a number of values in 2D, you'll get a data frame.

In [7]:
df.loc['b']

x    40
y    50
z    60
Name: b, dtype: int64

In [8]:
df.loc['d']

x    100
y    110
z    120
Name: d, dtype: int64

In [10]:
%xmode Minimal
df.loc['x']

Exception reporting mode: Minimal

KeyError: 'x'

In [11]:
# how can I retrieve a single column?
# for this, we use just []! 
# this is why I asked you last week *NOT* to use just [] to get items from a series,
# but rather to use .loc and .iloc

df['x']  # this is a column, and we get it back!

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [12]:
# can I retrieve more than one row, or more than one column?
# remember, we can use "fancy indexing," passing a list of index/column names

df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [13]:
df.loc[['a', 'c']]  # fancy indexing

    x   y   z
a  10  20  30
c  70  80  90

In [15]:
df.loc['b':'d']   # slice -- only one pair of [] -- with .loc, the endpoint is included!

     x    y    z
b   40   50   60
c   70   80   90
d  100  110  120

In [16]:
# you can do similar things with .iloc, which uses the numeric position

df.iloc[1]

x    40
y    50
z    60
Name: b, dtype: int64

In [17]:
df.iloc[[1, 3]]

     x    y    z
b   40   50   60
d  100  110  120

In [19]:
df.iloc[1:3]  # this is up to and *not* including, as usual in Python

    x   y   z
b  40  50  60
c  70  80  90

In [20]:
# how can I retrieve multiple columns?
# answer: just use a list of column names, as you would with the index

df[['x', 'z']]

     x    z
a   10   30
b   40   60
c   70   90
d  100  120

In [21]:
df[['z', 'x']]   # retrieve them in a different order

     z    x
a   30   10
b   60   40
c   90   70
d  120  100

In [22]:
# sometimes, you might want a one-column data frame, rather than a series
# you could say

df['x']

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [23]:
# instead, you can say

df[['x']]   # the [[ ]] means: I want a data frame back, even though, just one column

     x
a   10
b   40
c   70
d  100

In [24]:
# once you have retrieved from a data frame, you can perform all sorts of calculations
# using methods -- min, mean, max, std, median, etc.

# Exercise: Grocery store

1. Create a data frame in which you have two columns. One is the price of an item (`price`), and the other will be the number of sales of that item (`sales`). The index will be the names of the items that you are selling.
2. The data frame should have 4 rows, and each item will have a price and a number of sales.
3. Retrieve all of the info for apples.
4. Retrieve all of the info for bananas.
5. Retrieve all information for apples and bananas.
6. What is the mean price for all products?
7. What is the mean price for just apples and bananas?

In [26]:
df = DataFrame([[10, 5],
                [15, 4],
                [7, 10],
                [20, 2]],
            index='apple banana cucumber dill'.split(),
             columns='price sales'.split())

df

          price  sales
apple        10      5
banana       15      4
cucumber      7     10
dill         20      2

In [27]:
# Retrieve all of the info for apples.

df.loc['apple']

price    10
sales     5
Name: apple, dtype: int64

In [28]:
# Retrieve all of the info for bananas.

df.loc['banana']

price    15
sales     4
Name: banana, dtype: int64

In [29]:
# Retrieve all information for apples and bananas.

df.loc[  ['apple', 'banana']   ]

        price  sales
apple      10      5
banana     15      4

In [30]:
# What is the mean price for all products?

df['price'].mean()

np.float64(13.0)

In [31]:
# What is the mean price for just apples and bananas?

df.loc[ ['apple', 'banana']]

        price  sales
apple      10      5
banana     15      4

In [33]:
df.loc[ ['apple', 'banana']] ['price'].mean()

np.float64(12.5)

In [35]:
# a better way, if we have both the rows we want and the column(s) we want,
# is to use the 2-argument version of df.loc:

(
df.loc[ 
    ['apple', 'banana'],  # row selector
    ['price']]            # column selector
    .mean()
)

price    12.5
dtype: float64

# Modifying our data frame

1. We can add a new column by assigning to it. (If the column name already exists, then we replace the old one.) Just make sure that the value we assign to it has the same number of elements as the data frame's index!
2. We can add a new row by assigning to `.loc`. Here, if the index already exists, we get a new row anyway, with the same (repeated) index.

In [37]:
supermarket_df = df
supermarket_df

          price  sales
apple        10      5
banana       15      4
cucumber      7     10
dill         20      2

In [38]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [39]:
df['new_column'] = [2,4,6,8]

In [40]:
df

     x    y    z  new_column
a   10   20   30           2
b   40   50   60           4
c   70   80   90           6
d  100  110  120           8

In [41]:
df['new_column'] = [1,2,3,4]

In [42]:
df

     x    y    z  new_column
a   10   20   30           1
b   40   50   60           2
c   70   80   90           3
d  100  110  120           4

In [43]:
df['w'] = [1,2,3]

ValueError: Length of values (3) does not match length of index (4)

In [44]:
# we can calculate based on existing series,
# and then assign the result to a new series!

df['x'] + df['y']

a     30
b     90
c    150
d    210
dtype: int64

In [45]:
df['x_and_y'] = df['x'] + df['y']

In [46]:
df

     x    y    z  new_column  x_and_y
a   10   20   30           1       30
b   40   50   60           2       90
c   70   80   90           3      150
d  100  110  120           4      210

In [47]:
# what happens if I want to add a new row?

df.loc['e'] = [200, 300, 400, 500, 600]

df

     x    y    z  new_column  x_and_y
a   10   20   30           1       30
b   40   50   60           2       90
c   70   80   90           3      150
d  100  110  120           4      210
e  200  300  400         500      600

# Exercise: More groceries!

1. Define a new column, `revenue`, for the groceries, which will be `price` * `sales`. What is the mean of the `revenue` column?
2. Define a new column, `sales_tax`, in which you calculate 10% of the revenue.
3. Define a new column, `net`, which is `revenue` - `sales_tax`

In [48]:
supermarket_df

          price  sales
apple        10      5
banana       15      4
cucumber      7     10
dill         20      2

In [49]:
supermarket_df['price'] * supermarket_df['sales']

apple       50
banana      60
cucumber    70
dill        40
dtype: int64

In [51]:
supermarket_df['revenue'] = supermarket_df['price'] * supermarket_df['sales']
supermarket_df

          price  sales  revenue
apple        10      5       50
banana       15      4       60
cucumber      7     10       70
dill         20      2       40

In [52]:
supermarket_df['sales_tax'] = supermarket_df['revenue'] * 0.1
supermarket_df

          price  sales  revenue  sales_tax
apple        10      5       50        5.0
banana       15      4       60        6.0
cucumber      7     10       70        7.0
dill         20      2       40        4.0

In [53]:
supermarket_df['revenue'] - supermarket_df['sales_tax']

apple       45.0
banana      54.0
cucumber    63.0
dill        36.0
dtype: float64

In [55]:
supermarket_df['net'] = supermarket_df['revenue'] * 0.9
supermarket_df

          price  sales  revenue  sales_tax   net
apple        10      5       50        5.0  45.0
banana       15      4       60        6.0  54.0
cucumber      7     10       70        7.0  63.0
dill         20      2       40        4.0  36.0

# Alternative syntax for columns: dot syntax

Instead of saying `df[colname]` to get a column, you can say `df.colname`, with a `.`!

The good news:
- Shorter

The bad news:
- You might get confused about column names vs. methods vs. other attributes on a data frame
- If you have a column with the same name as a Pandas method, bad news!
- If you have a column with spaces or other special characters, that's not allowed with dot syntax
- It makes (I believe) for more confusing code, because it's less obvious which are the methods and which are the columns

In [57]:
supermarket_df.revenue

apple       50
banana      60
cucumber    70
dill        40
Name: revenue, dtype: int64

# Next up

1. Useful methods (data frame versions of many you know, and some new ones)
2. Boolean/mask indexes and our data frames

# Rule of thumb #1

Anywhere you can pass a single string (for an index, or a column name), you can pass a list of strings (for more than one index, or more than one column name).

# Rule of thumb #2

Anything you can do to a series, you can do to a data frame:

- If the series version of a method returns a single (scalar) value, then the data frame version of the same method will return a series.
- If the series version of a method returns a series, then the data frame version of the same method will return a data frame.

In [58]:
s = Series([10, 20, 30, 40, 50, 60, 70, 80],
          index=list('abcdefgh'))

# I'll use a dict of lists; each key is a column name, and each value
# is a list, the values for that column

df = DataFrame({'numbers': [10, 20, 30, 40, 50, 60, 70,  80],
               'times_10': [100, 200, 300, 400, 500, 600, 700, 800]},
              index=list('abcdefgh'))

s

a    10
b    20
c    30
d    40
e    50
f    60
g    70
h    80
dtype: int64

In [59]:
df

   numbers  times_10
a       10       100
b       20       200
c       30       300
d       40       400
e       50       500
f       60       600
g       70       700
h       80       800

In [60]:
# what's the mean of s?

s.mean()   # this returns a single (scalar) value

np.float64(45.0)

In [62]:
# what's the mean of df?
# by our rule #2, we'll get a result for each column
# if you run a method on a data frame, you get one result per column

df.mean()  # this will return a series

numbers      45.0
times_10    450.0
dtype: float64

In [63]:
s.min()

np.int64(10)

In [64]:
s.max()

np.int64(80)

In [65]:
df.min()

numbers      10
times_10    100
dtype: int64

In [66]:
df.max()

numbers      80
times_10    800
dtype: int64

In [67]:
# I can, instead, just run s.describe() to get all of the 
# descriptive statistics for my series

s.describe()   # describe returns a series for our series

count     8.000000
mean     45.000000
std      24.494897
min      10.000000
25%      27.500000
50%      45.000000
75%      62.500000
max      80.000000
dtype: float64

In [68]:
df.describe()  # describe will give us a series of descriptions for each column

         numbers    times_10
count   8.000000    8.000000
mean   45.000000  450.000000
std    24.494897  244.948974
min    10.000000  100.000000
25%    27.500000  275.000000
50%    45.000000  450.000000
75%    62.500000  625.000000
max    80.000000  800.000000

In [69]:
# get the first 5 values from our series

s.head()

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [70]:
s.head(5)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [71]:
s.tail()

d    40
e    50
f    60
g    70
h    80
dtype: int64

In [72]:
s.tail(5)

d    40
e    50
f    60
g    70
h    80
dtype: int64

In [73]:
# head/tail give us a series from a series
# head/tail will give us a data frame from a data frame

df.head()

   numbers  times_10
a       10       100
b       20       200
c       30       300
d       40       400
e       50       500

In [74]:
df.tail()

   numbers  times_10
d       40       400
e       50       500
f       60       600
g       70       700
h       80       800

In [75]:
import numpy as np

s = Series([10, 20, np.nan, 40, 50, np.nan, 70, 80],
          index=list('abcdefgh'))

# I'll use a dict of lists; each key is a column name, and each value
# is a list, the values for that column

df = DataFrame({'numbers': [10, 20, np.nan, 40, 50, np.nan, 70,  80],
               'times_10': [100, 200, 300, np.nan, 500, 600, 700, np.nan]},
              index=list('abcdefgh'))

s

a    10.0
b    20.0
c     NaN
d    40.0
e    50.0
f     NaN
g    70.0
h    80.0
dtype: float64

In [77]:
df

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
c      NaN     300.0
d     40.0       NaN
e     50.0     500.0
f      NaN     600.0
g     70.0     700.0
h     80.0       NaN

In [78]:
# how can I deal with NaN?
# option 1: delete it!

s.dropna()  # this returns a new series, without the NaN values

a    10.0
b    20.0
d    40.0
e    50.0
g    70.0
h    80.0
dtype: float64

In [88]:
df.dropna() # this returns a new data frame, without any ROW containing NaN

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
e     50.0     500.0
g     70.0     700.0

In [80]:
df

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
c      NaN     300.0
d     40.0       NaN
e     50.0     500.0
f      NaN     600.0
g     70.0     700.0
h     80.0       NaN

In [81]:
# what if you only care about NaN values in numbers, but they're OK in times_10?
# you can specify the "subset" keyword argument, indicating that where to look
# for NaN values

df.dropna(subset='numbers')

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
d     40.0       NaN
e     50.0     500.0
g     70.0     700.0
h     80.0       NaN

In [82]:
df.dropna(subset=['numbers', 'times_10'])

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
e     50.0     500.0
g     70.0     700.0

In [83]:
# fillna -- similar!
s.fillna(999)   # this returns a new series in which NaN is replaced by 999

a     10.0
b     20.0
c    999.0
d     40.0
e     50.0
f    999.0
g     70.0
h     80.0
dtype: float64

In [84]:
df.fillna(999)  # yes, this will work!

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
c    999.0     300.0
d     40.0     999.0
e     50.0     500.0
f    999.0     600.0
g     70.0     700.0
h     80.0     999.0

In [85]:
# another approach: let's replace NaN with the mean
s.fillna(s.mean())  # calculate s.mean(), and use it to replace NaN

a    10.0
b    20.0
c    45.0
d    40.0
e    50.0
f    45.0
g    70.0
h    80.0
dtype: float64

In [86]:
df.mean()

numbers      45.0
times_10    400.0
dtype: float64

In [87]:
df.fillna(df.mean()) # this uses the numbers mean to fill numbers, and the
                     # times_10 mean to fill times_10

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
c     45.0     300.0
d     40.0     400.0
e     50.0     500.0
f     45.0     600.0
g     70.0     700.0
h     80.0     400.0

# dtypes are per column, aka per series

We know that the dtype indicates what single type all values in a series must have.
In a data frame, I've already told you that each column is a series. But let's prove it.

The "dtypes" attribute returns the dtype for each column!

In [90]:
df.dtypes

numbers     float64
times_10    float64
dtype: object

In [91]:
df['also_numbers'] = range(8)

In [92]:
df

   numbers  times_10  also_numbers
a     10.0     100.0             0
b     20.0     200.0             1
c      NaN     300.0             2
d     40.0       NaN             3
e     50.0     500.0             4
f      NaN     600.0             5
g     70.0     700.0             6
h     80.0       NaN             7

In [93]:
df.dtypes

numbers         float64
times_10        float64
also_numbers      int64
dtype: object

In [97]:
# what if I want to fillna with a different value for each column?
# not a different computed value, but a different "static" value?

# in df, I want to replace NaN in numbers with 999 and in times_10 with 9990.
# we can pass a dictionary!

df.fillna({'numbers':999, 'times_10':9990})

   numbers  times_10  also_numbers
a     10.0     100.0             0
b     20.0     200.0             1
c    999.0     300.0             2
d     40.0    9990.0             3
e     50.0     500.0             4
f    999.0     600.0             5
g     70.0     700.0             6
h     80.0    9990.0             7

# Exercise: Temperatures

1. Define a data frame with the 10-day forecast for low and high temperatures in your city. (There should be 10 rows and 2 columns. )When entering the data, replace some of the values with `np.nan`.
2. Replace all `NaN` values with a single value.
3. Replace `NaN` values in `highs` and `lows` with different static values.
4. Replace `NaN` values in each column with that column's mean.

In [99]:
# once again, I'll use a dict of lists
df = DataFrame({'highs':[10, np.nan, 12, 15, np.nan, 15, 18, 19],
               'lows': [8, 6, np.nan, 11, 10, np.nan, 8, 8]},
              index='1902 2002 2102 2202 2302 2402 2502 2602'.split())
df

      highs  lows
1902   10.0   8.0
2002    NaN   6.0
2102   12.0   NaN
2202   15.0  11.0
2302    NaN  10.0
2402   15.0   NaN
2502   18.0   8.0
2602   19.0   8.0

In [100]:
df.fillna(12)  # this returns a new data frame, based on df, with all nans turned to 12

      highs  lows
1902   10.0   8.0
2002   12.0   6.0
2102   12.0  12.0
2202   15.0  11.0
2302   12.0  10.0
2402   15.0  12.0
2502   18.0   8.0
2602   19.0   8.0

In [101]:
# Replace NaN values in highs and lows with different static values.

df.fillna({'highs':15, 'lows':12})

      highs  lows
1902   10.0   8.0
2002   15.0   6.0
2102   12.0  12.0
2202   15.0  11.0
2302   15.0  10.0
2402   15.0  12.0
2502   18.0   8.0
2602   19.0   8.0

In [102]:
# Replace NaN values in each column with that column's mean.

df.fillna(df.mean())

          highs  lows
1902  10.000000   8.0
2002  14.833333   6.0
2102  12.000000   8.5
2202  15.000000  11.0
2302  14.833333  10.0
2402  15.000000   8.5
2502  18.000000   8.0
2602  19.000000   8.0

In [103]:
# isn't there any other way to replace nan values?
# yes, and it's even better: interpolation!

# the idea behind interpolation is:
# - if you have a NaN with two numbers around it, just replace NaN with their mean
# - if you have two NaNs with numbers around them, then replace them in step fashion
#   so if you have 10, nan, nan, 19, then they would be 10, 13, 16, 19

df.interpolate()

      highs  lows
1902   10.0   8.0
2002   11.0   6.0
2102   12.0   8.5
2202   15.0  11.0
2302   15.0  10.0
2402   15.0   9.0
2502   18.0   8.0
2602   19.0   8.0

Interpolation is *great*. But it's only appropriate in some data sets. Temperatures, or even stock prices, can be done this way. You know that the value is wrong, but it's less wrong than any other guess you'll make.  But if you interpolate a stock price during a flash crash, then you'll be *very* wrong.

# Boolean indexes!

We saw last week that we can use a boolean series as a "mask index," to keep only selected values in our series. This means that we can perform a comparison, get a boolean series back, and then apply that back to the series with `.loc`, keeping only those that are `True`.

In [104]:
s

a    10.0
b    20.0
c     NaN
d    40.0
e    50.0
f     NaN
g    70.0
h    80.0
dtype: float64

In [107]:
# I first calculate s<60, giving me a boolean series
# I apply that to s.loc in []
# I keep only the values where that boolean series had True
s.loc[s < 60]

a    10.0
b    20.0
d    40.0
e    50.0
dtype: float64

In [110]:
# can I do that with a data frame?
# of course!

# one possibility: apply a boolean series to the entire data frame

df.loc[ df['highs'] < 15 ]    # keep only those rows where df['highs'] < 15

      highs  lows
1902   10.0   8.0
2102   12.0   NaN

In [111]:
df.loc[ df['highs'] < df['lows'] ]

Empty DataFrame
Columns: [highs, lows]
Index: []

In [113]:
df.loc[ df['highs'] - df['lows'] >= 10 ]

      highs  lows
2502   18.0   8.0
2602   19.0   8.0

When we use `df.loc` on the *entire* data frame with a boolean series, we get back all of those *rows* for which this is true.

# Temp comparisons

1. Find all of the days on which the high temperature will be 50% higher than the low.
2. Find all of the days on which the high and low temperature will be within 5 degrees of one another.

In [115]:
df

      highs  lows
1902   10.0   8.0
2002    NaN   6.0
2102   12.0   NaN
2202   15.0  11.0
2302    NaN  10.0
2402   15.0   NaN
2502   18.0   8.0
2602   19.0   8.0

In [119]:
df.loc[  df['highs'] >= df['lows'] * 1.5  ]

      highs  lows
2502   18.0   8.0
2602   19.0   8.0

In [122]:
df.loc[  (df['highs'] - df['lows']) <= 5  ]

      highs  lows
1902   10.0   8.0
2202   15.0  11.0

# Next up

1. Using `.loc` in more sophisticated ways
2. Reading data from CSV and other sources

Download, if you haven't already, the zipfile of CSV files from https://files.lerner.co.il/data-science-exercise-files.zip

In [125]:
df

      highs  lows
1902   10.0   8.0
2002    NaN   6.0
2102   12.0   NaN
2202   15.0  11.0
2302    NaN  10.0
2402   15.0   NaN
2502   18.0   8.0
2602   19.0   8.0

In [126]:
# I want the low temperature on Feb 21st

df.loc['2102']

highs    12.0
lows      NaN
Name: 2102, dtype: float64

In [128]:
# unfortunately, this works!

df.loc['2102'].loc['lows']

np.float64(nan)

In [129]:
# it's much better to pass *two* arguments to df.loc,
# the row selector and the column selector.

# each of these -- the row selector and column selector - can have
# a variety of syntaxes and contents. But the goal is the same,
# to tell Pandas which rows and which columns you want.

df.loc[
    '2102',  # row selector -- one string, so one row
    'lows'   # column selector - -one string, so one column
    ]

np.float64(nan)

In [132]:

df.loc[
    ['2102', '2502'],  # row selector -- list of strings, so more than one row
    'lows'             # column selector - -one string, so one column
    ]

2102    NaN
2502    8.0
Name: lows, dtype: float64

In [133]:

df.loc[
    '2102',            # row selector -- one string, so one row
    ['highs','lows']   # column selector -- a list of strings, so multiple columns
    ]

highs    12.0
lows      NaN
Name: 2102, dtype: float64

In [134]:
# what if I have both being lists of strings?


df.loc[
    ['2102', '2502'],  # row selector -- list of strings, so more than one row
    ['highs','lows']   # column selector -- a list of strings, so multiple columns
    ]

      highs  lows
2102   12.0   NaN
2502   18.0   8.0

In [135]:
# we've already seen that we can use a boolean series to select
# that boolean series (i.e., that mask index) can be used as our row select
# (it can be used as a column selector, but that's weird)


df.loc[
    df['highs'] > 10,   # row selector -- a boolean series
    'highs' # column selector, with one column
    ]

2102    12.0
2202    15.0
2402    15.0
2502    18.0
2602    19.0
Name: highs, dtype: float64

In [136]:

df.loc[
    '2102':'2502'  # row selector, as a slice
    'highs' # column selector, with one column
    ]

      highs  lows
2102   12.0   NaN
2202   15.0  11.0
2302    NaN  10.0
2402   15.0   NaN
2502   18.0   8.0

# Exercise: Using `.loc`

1. Retrieve all rows from the high-low temp data frame where the high temp is within 5 degrees of the low temp, and show only the low-temp columns.
2. Retrieve all rows where the low is greater than the mean, and show the high-temp column only.
3.

In [138]:
df = df.interpolate()
df

      highs  lows
1902   10.0   8.0
2002   11.0   6.0
2102   12.0   8.5
2202   15.0  11.0
2302   15.0  10.0
2402   15.0   9.0
2502   18.0   8.0
2602   19.0   8.0

In [140]:
# Retrieve all rows from the high-low temp data frame where the high temp is within 5 degrees 
# of the low temp, and show only the low-temp columns.

df.loc[
    df['highs'] - df['lows'] <= 5,   # row selector
    'lows'    # column selector
]

1902     8.0
2002     6.0
2102     8.5
2202    11.0
2302    10.0
Name: lows, dtype: float64

In [141]:

df.loc[
    df['highs'] - df['lows'] <= 5,   # row selector
    ['lows']    # column selector
]

      lows
1902   8.0
2002   6.0
2102   8.5
2202  11.0
2302  10.0

In [144]:
# Retrieve all rows where the low is greater than the mean, and show 
# the high-temp column only.

df.loc[
    df['lows'] > df['lows'].mean(),   # row selector
    'highs'
    ]

2202    15.0
2302    15.0
2402    15.0
Name: highs, dtype: float64

In [146]:
# new new new in Pandas 3.0

df.loc[
    pd.col('lows') > pd.col('lows').mean(),   # row selector
    'highs'
    ]

2202    15.0
2302    15.0
2402    15.0
Name: highs, dtype: float64

# Getting data from the outside world

So far, we have either used nonsense data or we have entered it ourselves, manually. Neither is realistic or reflects the actual way we use data.

Normally, we'll load it in from an external source:

- A file on disk
- A file on the network
- A database

Very commonly, we use files, and those files can be read into Pandas, and thus into a data frame. 

What format are these files in? The most common formats are CSV (comma-separated values) and Excel. Both of these formats have big problems, and force us to resolve ambiguities.\

There is finally a good, portable, binary, and small format, known as parquet, thanks to the Apache Arrow open-source project. 

To create a data frame from a file, we will use the `pd.read_*` functions, and specifically `pd.read_csv` to read from a CSV into a data frame.

Note: This is not a `df` method, but a `pd` method (or function). That's because we're building a new data frame, not running something on an existing one.

`pd.read_csv(filename)` returns a new data frame

CSV is a very very very loose standard. Yes, every line has one record. Yes, records are separated. But beyond that, there is a lot of flexibility:

- What separator do we use between fields? By default, commas, but tabs and colons and others are also common.
- Does the first line show the column names? Maybe...maybe not.
- Are there junk lines before the column names?

When you invoke `read_csv`, if you're lucky, then the file will load up just fine. Pandas will assign one of three dtypes to every column:

- `int64` if it contains only integers
- `float64` if it contains integers + a decimal point
- `object` or `str`, for strings, if it cannot figure out what to use

In [147]:
# I have a file with 10k taxi rides from 2016
# here's what the file looks like (the first few lines)

# Jupyter lets you run Unix commands if you're on a Mac/Linux
# you use ! at the start of the line, then the rest is a Unix command
!head taxi.csv

VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954429626464844,40.764141082763672,1,N,-73.974754333496094,40.754093170166016,2,17,0,0.5,0,0,0.3,17.8
2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,.46,-73.971443176269531,40.758941650390625,1,N,-73.978538513183594,40.761909484863281,1,6.5,0,0.5,1,0,0.3,8.3
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,.87,-73.978111267089844,40.738433837890625,1,N,-73.990272521972656,40.745437622070313,1,8,0,0.5,2.2,0,0.3,11
2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892333984375,40.773529052734375,1,N,-73.971527099609375,40.760330200195312,1,13.5,0,0.5,2.86,0,0.3,17.16
1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979087829589844,40.776771545410156,1,N,-73.982162475585937,40.758998870849609,2,9.5,0,0.5,0,0,0.3,10.3
1,2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,-73.94464111328125,40.779464721679688,1,N,-73.96136474609375,40.771560668945313,1,8,0,0.5,1.75,0,0.3,10.55
1,2015-06-02 11:19:34,2015-06-02 11:38:46,1,1.80,-73.992866516113281,40.748210906982422,1,N,-73.969772338867187,40.748458862304687,1,12.5,0,0.5,3,0,0.3,16.3
1,2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,-73.863075256347656,40.769252777099609,1,N,-73.986709594726563,40.761306762695313,1,52.5,0,0.5,15,5.54,0.3,73.84
2,2015-06-02 11:19:36,2015-06-02 11:45:19,1,1.27,-73.991432189941406,40.749305725097656,1,N,-73.985061645507813,40.759525299072266,2,15,0,0.5,0,0,0.3,15.8

In [148]:
df = pd.read_csv('taxi.csv')

df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9994,1,2015-06-01 00:12:59,2015-06-01 00:24:18,1,2.70,-73.947792,40.814972,1,N,-73.973358,40.783638,2,11.0,0.5,0.5,0.00,0.0,0.3,12.30
9995,1,2015-06-01 00:12:59,2015-06-01 00:28:16,1,4.50,-74.004066,40.747818,1,N,-73.953758,40.779285,1,16.0,0.5,0.5,3.00,0.0,0.3,20.30
9996,2,2015-06-01 00:13:00,2015-06-01 00:37:25,1,5.59,-73.994377,40.766102,1,N,-73.903206,40.750546,2,21.0,0.5,0.5,0.00,0.0,0.3,22.30
9997,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302,40.748531,1,N,-73.989166,40.762852,2,6.5,0.5,0.5,0.00,0.0,0.3,7.80
9998,1,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.80,-73.983215,40.726414,1,N,-73.924133,40.701645,1,21.0,0.5,0.5,4.45,0.0,0.3,26.75

In [149]:
df.dtypes

VendorID                   int64
tpep_pickup_datetime         str
tpep_dropoff_datetime        str
passenger_count            int64
trip_distance            float64
pickup_longitude         float64
pickup_latitude          float64
RateCodeID                 int64
store_and_fwd_flag           str
dropoff_longitude        float64
dropoff_latitude         float64
payment_type               int64
fare_amount              float64
extra                    float64
mta_tax                  float64
tip_amount               float64
tolls_amount             float64
improvement_surcharge    float64
total_amount             float64
dtype: object

# Exercise: Taxi queries

1. Download the zipfiles I told you about, and make sure that you know where `taxi.csv` is located on your computer. (If you put it in the same directory as you're running Jupyter, it's a bit easier.)
2. Use `pd.read_csv` to load `taxi.csv` into a data frame.
3. Find the mean `trip_distance`.
4. Were there any trips with a 0 distance. If so, how much did people pay, on average?
5. Were there any trips with <= 0 `total_amount`? If so, how many passengers were on such trips, and how far did they go?

In [150]:
df = pd.read_csv('taxi.csv')

In [152]:
df.head()  # whenever I load a CSV file, I peek at its first 5 rows with head

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

In [154]:
df['trip_distance'].mean()

np.float64(3.1585108510851088)

In [155]:
df['trip_distance'].median()

np.float64(1.7)

In [156]:
df['trip_distance'].max()

np.float64(64.6)

In [158]:
df.loc[ df['trip_distance'] == 0  ]

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
149,1,2015-06-02 11:21:25,2015-06-02 11:21:50,1,0.0,-73.978493,40.748562,1,N,-73.978493,40.748604,1,2.5,0.0,0.5,1.00,0.00,0.3,4.30
246,1,2015-06-02 11:19:46,2015-06-02 12:26:33,1,0.0,-73.983200,40.766949,1,N,-73.990410,40.766872,2,2.5,0.0,0.5,0.00,0.00,0.3,3.30
297,2,2015-06-02 11:20:23,2015-06-02 11:20:23,2,0.0,-73.937851,40.758236,1,N,0.000000,0.000000,2,1.5,0.0,0.5,0.00,0.00,0.3,2.30
657,1,2015-06-02 11:24:33,2015-06-02 11:24:50,1,0.0,-73.996460,40.732124,5,N,-73.996429,40.732147,1,12.0,0.0,0.0,3.05,0.00,0.3,15.35
660,2,2015-06-02 11:24:35,2015-06-02 11:24:40,1,0.0,0.000000,0.000000,1,N,-73.749077,40.707611,2,2.5,0.0,0.5,0.00,0.00,0.3,3.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9016,1,2015-06-01 00:07:43,2015-06-01 00:07:43,1,0.0,-74.007530,40.740753,1,N,0.000000,0.000000,2,5.0,0.5,0.5,0.00,0.00,0.3,6.30
9087,1,2015-06-01 00:07:39,2015-06-01 00:07:49,2,0.0,-73.971931,40.791393,2,N,-73.971939,40.791382,1,52.0,0.0,0.5,11.65,5.54,0.3,69.99
9093,2,2015-06-01 00:07:46,2015-06-01 00:07:51,1,0.0,0.000000,0.000000,2,N,0.000000,0.000000,1,52.0,0.0,0.5,13.20,0.00,0.3,66.00
9740,1,2015-06-01 00:12:13,2015-06-01 00:13:47,1,0.0,-74.005714,40.740582,1,N,-74.005417,40.740803,3,3.0,0.5,0.5,0.00,0.00,0.3,4.30
9761,1,2015-06-01 00:12:46,2015-06-01 00:12:46,1,0.0,-73.999535,40.738533,1,N,0.000000,0.000000,2,4.5,0.5,0.5,0.00,0.00,0.3,5.80

In [160]:
# two-argument df.loc!

df.loc[
        df['trip_distance'] == 0,    # row selector
        'total_amount'               # column selector
].mean()

np.float64(31.581940298507465)

In [162]:
# 5. Were there any trips with <= 0 `total_amount`? If so, 
# how many passengers were on such trips, and how far did they go?

df.loc[df['total_amount'] <= 0  ]

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
2903,2,2015-06-02 11:24:35,2015-06-02 11:24:40,1,0.00,0.000000,0.000000,1,N,-73.749077,40.707611,3,-2.5,0.0,-0.5,0.0,0.0,-0.3,-3.3
5719,2,2015-06-04 15:17:15,2015-06-04 15:26:40,1,0.89,-73.962166,40.773739,1,N,-73.962173,40.764603,4,-7.0,0.0,-0.5,0.0,0.0,-0.3,-7.8
9276,2,2015-06-01 00:09:21,2015-06-01 00:14:43,1,0.93,-73.954491,40.766140,1,N,-73.966614,40.759899,3,-6.0,-0.5,-0.5,0.0,0.0,-0.3,-7.3

In [164]:
df.loc[
    df['total_amount'] <= 0,   # row selector
    ['passenger_count', 'trip_distance']  # column selector
]

      passenger_count  trip_distance
2903                1           0.00
5719                1           0.89
9276                1           0.93

In [165]:
df.loc[
    df['total_amount'] <= 0,   # row selector
    ['passenger_count', 'trip_distance']  # column selector
].mean()

passenger_count    1.000000
trip_distance      0.606667
dtype: float64

# CSV is a terrible format

Because it's so poorly specified, there are a lot of variants of CSV running around. When you load a CSV file, it might load perfectly, like `taxi.csv`. But it also might give you trouble because it's not quite in the format Pandas expects.

For that reason, `read_csv` has a *ton* of options, all specified as Python keyword arguments.

In [166]:
help(pd.read_csv)

Help on function read_csv in module pandas:

read_csv(
    filepath_or_buffer: FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str],
    *,
    sep: str | None | lib.NoDefault = <no_default>,
    delimiter: str | None | lib.NoDefault = None,
    header: int | Sequence[int] | None | Literal['infer'] = 'infer',
    names: Sequence[Hashable] | None | lib.NoDefault = <no_default>,
    index_col: IndexLabel | Literal[False] | None = None,
    usecols: UsecolsArgType = None,
    dtype: DtypeArg | None = None,
    engine: CSVEngine | None = None,
    converters: Mapping[HashableT, Callable] | None = None,
    true_values: list | None = None,
    false_values: list | None = None,
    skipinitialspace: bool = False,
    skiprows: list[int] | int | Callable[[Hashable], bool] | None = None,
    skipfooter: int = 0,
    nrows: int | None = None,
    na_values: Hashable | Iterable[Hashable] | Mapping[Hashable, Iterable[Hashable]] | None = None,
    keep_default_na: bool = True,
    na_filter: bool = True,
    skip_blank_lines: bool = True,
    parse_dates: bool | Sequence[Hashable] | None = None,
    date_format: str | dict[Hashable, str] | None = None,
    dayfirst: bool = False,
    cache_dates: bool = True,
    iterator: bool = False,
    chunksize: int | None = None,
    compression: CompressionOptions = 'infer',
    thousands: str | None = None,
    decimal: str = '.',
    lineterminator: str | None = None,
    quotechar: str = '"',
    quoting: int = 0,
    doublequote: bool = True,
    escapechar: str | None = None,
    comment: str | None = None,
    encoding: str | None = None,
    encoding_errors: str | None = 'strict',
    dialect: str | csv.Dialect | None = None,
    on_bad_lines: str = 'error',
    low_memory: bool = True,
    memory_map: bool = False,
    float_precision: Literal['high', 'legacy', 'round_trip'] | None = None,
    storage_options: StorageOptions | None = None,
    dtype_backend: DtypeBackend | lib.NoDefault = <no_default>
) -> DataFrame | TextFileReader
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Character or regex pattern to treat as the delimiter. If ``sep=None``, the
        C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator from only the first valid
        row of the file by Python's builtin sniffer tool, ``csv.Sniffer``.
        In addition, separators longer than 1 character and different from
        ``'\s+'`` will be interpreted as regular expressions and will also force
        the use of the Python parsing engine. Note that regex delimiters are prone
        to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, optional
        Alias for ``sep``.
    header : int, Sequence of int, 'infer' or None, default 'infer'
        Row number(s) containing column labels and marking the start of the
        data (zero-indexed). Default behavior is to infer the column names:
        if no ``names``
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly to ``names`` then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a :class:`~pandas.MultiIndex` on the columns
        e.g. ``[0, 1, 3]``. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.

        When inferred from the file contents, headers are kept distinct from
        each other by renaming duplicate names with a numeric suffix of the form
        ``".{{count}}"`` starting from 1, e.g. ``"foo"`` and ``"foo.1"``.
        Empty headers are named ``"Unnamed: {{i}}"`` or ``
        "Unnamed: {{i}}_level_{{level}}"``
        in the case of MultiIndex columns.
    names : Sequence of Hashable, optional
        Sequence of column labels to apply. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : Hashable, Sequence of Hashable or False, optional
        Column(s) to use as row label(s), denoted either by column labels or column
        indices.  If a sequence of labels or indices is given,
        :class:`~pandas.MultiIndex`
        will be formed for the row labels.

        Note: ``index_col=False`` can be used to force pandas to *not* use the first
        column as the index, e.g., when you have a malformed file with delimiters at
        the end of each line.
    usecols : Sequence of Hashable or Callable, optional
        Subset of columns to select, denoted either
        by column labels or column indices.
        If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in ``names`` or
        inferred from the document header row(s).
        If ``names`` are given, the document
        header row(s) are not taken into account. For example, a valid list-like
        ``usecols`` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a :class:`~pandas.DataFrame` from ``data`` with element order
        preserved use ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]``
        for columns in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to ``True``. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    dtype : dtype or dict of {{Hashable : dtype}}, optional
        Data type(s) to apply to either the whole dataset or individual columns.
        E.g., ``{{'a': np.float64, 'b': np.int32, 'c': 'Int64'}}``
        Use ``str`` or ``object`` together with suitable ``na_values`` settings
        to preserve and not interpret ``dtype``.
        If ``converters`` are specified, they will be applied INSTEAD
        of ``dtype`` conversion. Specify a ``defaultdict`` as input where
        the default determines the ``dtype``
        of the columns which are not explicitly
        listed.
    engine : {{'c', 'python', 'pyarrow'}}, optional
        Parser engine to use. The C and pyarrow engines are faster,
        while the python engine
        is currently more feature-complete. Multithreading
        is currently only supported by
        the pyarrow engine. Some features of the "pyarrow" engine
        are unsupported or may not work correctly.
    converters : dict of {{Hashable : Callable}}, optional
        Functions for converting values in specified columns. Keys can either
        be column labels or column indices.
    true_values : list, optional
        Values to consider as ``True`` in addition
        to case-insensitive variants of 'True'.
    false_values : list, optional
        Values to consider as ``False`` in addition to case-insensitive
        variants of 'False'.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : int, list of int or Callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (``int``)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning ``True`` if the row should be skipped and ``False``
        otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with ``engine='c'``).
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
        Refers to the number of data rows in the returned DataFrame, excluding:

        * The header row containing column names.
        * Rows before the header row, if ``header=1`` or larger.

        Example usage:

        * To read the first 999,999 (non-header) rows:
          ``read_csv(..., nrows=999999)``

        * To read rows 1,000,000 through 1,999,999:
          ``read_csv(..., skiprows=1000000, nrows=999999)``

    na_values : Hashable, Iterable of Hashable or dict of {{Hashable : Iterable}},
        optional
        Additional strings to recognize as ``NA``/``NaN``. If ``dict``
        passed, specific
        per-column ``NA`` values.  By default the following values
        are interpreted as
        ``NaN``: empty string, "NaN", "N/A", "NULL", and other common
        representations of missing data.
    keep_default_na : bool, default True
        Whether or not to include the default ``NaN`` values when parsing the data.
        Depending on whether ``na_values`` is passed in, the behavior is as follows:

        * If ``keep_default_na`` is ``True``, and ``na_values``
          are specified, ``na_values``
          is appended to the default ``NaN`` values used for parsing.
        * If ``keep_default_na`` is ``True``, and ``na_values`` are not specified, only
          the default ``NaN`` values are used for parsing.
        * If ``keep_default_na`` is ``False``, and ``na_values`` are specified, only
          the ``NaN`` values specified ``na_values`` are used for parsing.
        * If ``keep_default_na`` is ``False``, and ``na_values`` are not specified, no
          strings will be parsed as ``NaN``.

        Note that if ``na_filter`` is passed in as ``False``,
        the ``keep_default_na`` and
        ``na_values`` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of ``na_values``). In
        data without any ``NA`` values, passing ``na_filter=False`` can improve the
        performance of reading a large file.
    skip_blank_lines : bool, default True
        If ``True``, skip over blank lines rather than interpreting as ``NaN`` values.
    parse_dates : bool, None, list of Hashable, default None
        The behavior is as follows:

        * ``bool``. If ``True`` -> try parsing the index.
        * ``None``. Behaves like ``True`` if ``date_format`` is specified.
        * ``list`` of ``int`` or names.
          e.g. If ``[1, 2, 3]`` -> try parsing columns 1, 2, 3
          each as a separate date column.

        If a column or index cannot be represented as an array of ``datetime``,
        say because of an unparsable value or a mixture of timezones, the column
        or index will be returned unaltered as an ``object`` data type. For
        non-standard ``datetime`` parsing, use :func:`~pandas.to_datetime` after
        :func:`~pandas.read_csv`.

        Note: A fast-path exists for iso8601-formatted dates.
    date_format : str or dict of column -> format, optional
        Format to use for parsing dates and/or times when
        used in conjunction with ``parse_dates``.
        The strftime to parse time, e.g. :const:`"%d/%m/%Y"`. See
        `strftime documentation
        <https://docs.python.org/3/library/datetime.html
        #strftime-and-strptime-behavior>`_ for more information on choices, though
        note that :const:`"%f"`` will parse all the way up to nanoseconds.
        You can also pass:

        - "ISO8601", to parse any `ISO8601 <https://en.wikipedia.org/wiki/ISO_8601>`_
          time string (not necessarily in exactly the same format);
        - "mixed", to infer the format for each element individually. This is risky,
          and you should probably use it along with `dayfirst`.

        .. versionadded:: 2.0.0
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If ``True``, use a cache of unique, converted dates to apply the ``datetime``
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

    iterator : bool, default False
        Return ``TextFileReader`` object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Number of lines to read from the file per chunk. Passing a value will cause the
        function to return a ``TextFileReader`` object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.

    compression : str or dict, default 'infer'
        For on-the-fly decompression of on-disk data.
        If 'infer' and 'filepath_or_buffer' is
        path-like, then detect compression from the following extensions: '.gz',
        '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
        (otherwise no compression).
        If using 'zip' or 'tar', the ZIP file must contain only
        one data file to be read in.
        Set to ``None`` for no decompression.
        Can also be a dict with key ``'method'`` set
        to one of {``'zip'``, ``'gzip'``, ``'bz2'``,
        ``'zstd'``, ``'xz'``, ``'tar'``} and
        other key-value pairs are forwarded to
        ``zipfile.ZipFile``, ``gzip.GzipFile``,
        ``bz2.BZ2File``, ``zstandard.ZstdDecompressor``, ``lzma.LZMAFile`` or
        ``tarfile.TarFile``, respectively.
        As an example, the following could be passed for
        Zstandard decompression using a
        custom compression dictionary:
        ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

    thousands : str (length 1), optional
        Character acting as the thousands separator in numerical values.
    decimal : str (length 1), default '.'
        Character to recognize as decimal point (e.g., use ',' for European data).
    lineterminator : str (length 1), optional
        Character used to denote a line break. Only valid with C parser.
    quotechar : str (length 1), optional
        Character used to denote the start and end of a quoted item. Quoted
        items can include the ``delimiter`` and it will be ignored.
    quoting : {{0 or csv.QUOTE_MINIMAL, 1 or csv.QUOTE_ALL,
        2 or csv.QUOTE_NONNUMERIC, 3 or csv.QUOTE_NONE}}, default csv.QUOTE_MINIMAL
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Default is
        ``csv.QUOTE_MINIMAL`` (i.e., 0) which implies that
        only fields containing special
        characters are quoted (e.g., characters defined
        in ``quotechar``, ``delimiter``,
        or ``lineterminator``.
    doublequote : bool, default True
        When ``quotechar`` is specified and ``quoting`` is not ``QUOTE_NONE``, indicate
        whether or not to interpret two consecutive ``quotechar`` elements INSIDE a
        field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        Character used to escape other characters.
    comment : str (length 1), optional
        Character indicating that the remainder of line should not be parsed.
        If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter ``header`` but not by
        ``skiprows``. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in ``'a,b,c'`` being
        treated as the header.
    encoding : str, optional, default 'utf-8'
        Encoding to use for UTF when reading/writing (ex. ``'utf-8'``). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

    encoding_errors : str, optional, default 'strict'
        How encoding errors are treated. `List of possible values
        <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: ``delimiter``, ``doublequote``, ``escapechar``,
        ``skipinitialspace``, ``quotechar``, and ``quoting``. If it is necessary to
        override values, a ``ParserWarning`` will be issued. See ``csv.Dialect``
        documentation for more details.
    on_bad_lines : {{'error', 'warn', 'skip'}} or Callable, default 'error'
        Specifies what to do upon encountering a bad line (a line with too many fields).
        Allowed values are:

        - ``'error'``, raise an Exception when a bad line is encountered.
        - ``'warn'``, raise a warning when a bad line is
          encountered and skip that line.
        - ``'skip'``, skip bad lines without raising or warning when
          they are encountered.
        - Callable, function that will process a single bad line.
            - With ``engine='python'``, function with signature
              ``(bad_line: list[str]) -> list[str] | None``.
              ``bad_line`` is a list of strings split by the ``sep``.
              If the function returns ``None``, the bad line will be ignored.
              If the function returns a new ``list`` of strings with
              more elements than
              expected, a ``ParserWarning`` will be emitted while
              dropping extra elements.
            - With ``engine='pyarrow'``, function with signature
              as described in pyarrow documentation: `invalid_row_handler
              <https://arrow.apache.org/docs/python
              /generated/pyarrow.csv.ParseOptions.html
              #pyarrow.csv.ParseOptions.invalid_row_handler>`_.

        .. versionchanged:: 2.2.0

            Callable for ``engine='pyarrow'``

    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set ``False``, or specify the type with the ``dtype`` parameter.
        Note that the entire file is read into a single :class:`~pandas.DataFrame`
        regardless, use the ``chunksize`` or ``iterator``
        parameter to return the data in
        chunks. (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for ``filepath_or_buffer``, map the file object
        directly onto memory and access the data directly from there. Using this

# Most common `read_csv` keyword arguments

- `header` -- this says on which row of the file you can find header names; data starts after
- `sep` -- this is the string that separates fields (default is `','`)
- `usecols` -- if you only want some of the columns that a file contains
- `index_col` -- if one of the columns on disk should be set to the data frame's index

In [167]:
# let's say I want to get some basic info about my data frame
# and its contents

df.info()

<class 'pandas.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 19 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   VendorID               9999 non-null   int64
 1   tpep_pickup_datetime   9999 non-null   str
 2   tpep_dropoff_datetime  9999 non-null   str
 3   passenger_count        9999 non-null   int64
 4   trip_distance          9999 non-null   float64
 5   pickup_longitude       9999 non-null   float64
 6   pickup_latitude        9999 non-null   float64
 7   RateCodeID             9999 non-null   int64
 8   store_and_fwd_flag     9999 non-null   str
 9   dropoff_longitude      9999 non-null   float64
 10  dropoff_latitude       9999 non-null   float64
 11  payment_type           9999 non-null   int64
 12  fare_amount            9999 non-null   float64
 13  extra                  9999 non-null   float64
 14  mta_tax                9999 non-null   float64
 15  tip_amount             9999 non-null   float64
 16  tolls_amount           9999 non-null   float64
 17  improvement_surcharge  9999 non-null   float64
 18  total_amount           9999 non-null   float64
dtypes: float64(12), int64(4), str(3)
memory usage: 1.8 MB

# Next up

1. Other formats in general
2. Use those other `read_csv` options
3. Reading Excel
4. Reading HTML (if it works!)

We read a CSV file with `read_csv`. Pandas has about 20 methods, all of whose names start with `read_`, and they all work the same way. Meaning: We give them a filename, and they read the file, and produce a data frame. the only difference is what kind of file they are.

In [169]:
df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9994,1,2015-06-01 00:12:59,2015-06-01 00:24:18,1,2.70,-73.947792,40.814972,1,N,-73.973358,40.783638,2,11.0,0.5,0.5,0.00,0.0,0.3,12.30
9995,1,2015-06-01 00:12:59,2015-06-01 00:28:16,1,4.50,-74.004066,40.747818,1,N,-73.953758,40.779285,1,16.0,0.5,0.5,3.00,0.0,0.3,20.30
9996,2,2015-06-01 00:13:00,2015-06-01 00:37:25,1,5.59,-73.994377,40.766102,1,N,-73.903206,40.750546,2,21.0,0.5,0.5,0.00,0.0,0.3,22.30
9997,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302,40.748531,1,N,-73.989166,40.762852,2,6.5,0.5,0.5,0.00,0.0,0.3,7.80
9998,1,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.80,-73.983215,40.726414,1,N,-73.924133,40.701645,1,21.0,0.5,0.5,4.45,0.0,0.3,26.75

In [170]:
df.to_csv('newtaxi.csv', sep='\t')

In [171]:
!head newtaxi.csv

	VendorID	tpep_pickup_datetime	tpep_dropoff_datetime	passenger_count	trip_distance	pickup_longitude	pickup_latitude	RateCodeID	store_and_fwd_flag	dropoff_longitude	dropoff_latitude	payment_type	fare_amount	extra	mta_tax	tip_amount	tolls_amount	improvement_surcharge	total_amount
0	2	2015-06-02 11:19:29	2015-06-02 11:47:52	1	1.63	-73.95442962646484	40.76414108276367	1	N	-73.9747543334961	40.754093170166016	2	17.0	0.0	0.5	0.0	0.0	0.3	17.8
1	2	2015-06-02 11:19:30	2015-06-02 11:27:56	1	0.46	-73.97144317626953	40.758941650390625	1	N	-73.9785385131836	40.76190948486328	1	6.5	0.0	0.5	1.0	0.0	0.3	8.3
2	2	2015-06-02 11:19:31	2015-06-02 11:30:30	1	0.87	-73.97811126708984	40.738433837890625	1	N	-73.99027252197266	40.74543762207031	1	8.0	0.0	0.5	2.2	0.0	0.3	11.0
3	2	2015-06-02 11:19:31	2015-06-02 11:39:02	1	2.13	-73.94589233398438	40.773529052734375	1	N	-73.97152709960938	40.76033020019531	1	13.5	0.0	0.5	2.86	0.0	0.3	17.16
4	1	2015-06-02 11:19:32	2015-06-02 11:32:49	1	1.4	-73.97908782958984	40.77677154541016	1	N	-73.98216247558594	40.75899887084961	2	9.5	0.0	0.5	0.0	0.0	0.3	10.3
5	1	2015-06-02 11:19:33	2015-06-02 11:28:48	1	1.4	-73.94464111328125	40.77946472167969	1	N	-73.96136474609375	40.77156066894531	1	8.0	0.0	0.5	1.75	0.0	0.3	10.55
6	1	2015-06-02 11:19:34	2015-06-02 11:38:46	1	1.8	-73.99286651611328	40.74821090698242	1	N	-73.96977233886719	40.74845886230469	1	12.5	0.0	0.5	3.0	0.0	0.3	16.3
7	1	2015-06-02 11:19:35	2015-06-02 12:36:46	4	11.9	-73.86307525634764	40.76925277709961	1	N	-73.98670959472656	40.76130676269531	1	52.5	0.0	0.5	15.0	5.54	0.3	73.84
8	2	2015-06-02 11:19:36	2015-06-02 11:45:19	1	1.27	-73.9914321899414	40.749305725097656	1	N	-73.98506164550781	40.759525299072266	2	15.0	0.0	0.5	0.0	0.0	0.3	15.8

In [172]:
df = pd.read_csv('newtaxi.csv', sep='\t')
df.head()

,Unnamed: 0,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

In [173]:
# what if I assume the default separator of comma?
df = pd.read_csv('newtaxi.csv')
df.head()

  \tVendorID\ttpep_pickup_datetime\ttpep_dropoff_datetime\tpassenger_count\ttrip_distance\tpickup_longitude\tpickup_latitude\tRateCodeID\tstore_and_fwd_flag\tdropoff_longitude\tdropoff_latitude\tpayment_type\tfare_amount\textra\tmta_tax\ttip_amount\ttolls_amount\timprovement_surcharge\ttotal_amount
0  0\t2\t2015-06-02 11:19:29\t2015-06-02 11:47:52...
1  1\t2\t2015-06-02 11:19:30\t2015-06-02 11:27:56...
2  2\t2\t2015-06-02 11:19:31\t2015-06-02 11:30:30...
3  3\t2\t2015-06-02 11:19:31\t2015-06-02 11:39:02...
4  4\t1\t2015-06-02 11:19:32\t2015-06-02 11:32:49...

In [174]:
df = pd.read_csv('newtaxi.csv', sep='\t')
df.head()

,Unnamed: 0,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

In [176]:
df.memory_usage().sum()  # 1,989,997

np.int64(1989997)

In [177]:
# if I were to keep only a few of the columns, then 
# I could use less memory

df = pd.read_csv('newtaxi.csv', sep='\t',
                usecols=['passenger_count', 'trip_distance', 'total_amount'])

In [178]:
df.head()

   passenger_count  trip_distance  total_amount
0                1           1.63         17.80
1                1           0.46          8.30
2                1           0.87         11.00
3                1           2.13         17.16
4                1           1.40         10.30

In [180]:
df.memory_usage().sum()  # 240,172

np.int64(240172)

In [181]:
# what if a file contains NaN values?
# by default, read_* methods treat empty strings, NA, and N/A as NaN.
# what if the data file uses '...' as NaN?

# you can pass the na_values keyword argument, with either one string
# or a list of strings for all of the new, additional NaN values you want.

df = pd.read_csv('newtaxi.csv', sep='\t',
                usecols=['passenger_count', 'trip_distance', 'total_amount'],
                na_values=['...', '***'])

In [182]:
# I can always use set_index to tell Pandas that a particular column\
# should now be our index

# when we're loading a file, we can do that right away by passing index_col.


df = pd.read_csv('newtaxi.csv', sep='\t',
                usecols=['tpep_pickup_datetime', 'passenger_count', 'trip_distance', 'total_amount'],
                na_values=['...', '***'],
                index_col='tpep_pickup_datetime')

In [183]:
df

                      passenger_count  trip_distance  total_amount
tpep_pickup_datetime
2015-06-02 11:19:29                 1           1.63         17.80
2015-06-02 11:19:30                 1           0.46          8.30
2015-06-02 11:19:31                 1           0.87         11.00
2015-06-02 11:19:31                 1           2.13         17.16
2015-06-02 11:19:32                 1           1.40         10.30
...                               ...            ...           ...
2015-06-01 00:12:59                 1           2.70         12.30
2015-06-01 00:12:59                 1           4.50         20.30
2015-06-01 00:13:00                 1           5.59         22.30
2015-06-01 00:13:02                 6           1.54          7.80
2015-06-01 00:13:04                 1           5.80         26.75

[9999 rows x 3 columns]

# Pandas uses RAM!

All of a data frame must fit into your memory - RAM + virtual memory. But if you use virtual memory, then things slow down a lot. 

If your computer has 16 GB, and you load a 20 GB data frame, that will be bad!

# Exercises: Reading and writing taxi data

1. Read `taxi.csv`, but only keep `passenger_count`, `trip_distance`, `tip_amount`, and `total_amount` columns.
2. Add a new column, `tip_percentage`, which is `tip_amount` divided by `total_amount`, and get the mean for that columns.
3. Write this data frame to `taxi_tip.csv`, with tabs between the fields. Remember that you save a data frame as a file with `df.to_csv`, naming the file you want to create.
4. Read this all back in, and find the mean `trip_distance` where `total_amount` was > 50.

In [184]:
df = pd.read_csv('taxi.csv',
                usecols=['passenger_count', 'trip_distance',
                        'tip_amount', 'total_amount'])
df

      passenger_count  trip_distance  tip_amount  total_amount
0                   1           1.63        0.00         17.80
1                   1           0.46        1.00          8.30
2                   1           0.87        2.20         11.00
3                   1           2.13        2.86         17.16
4                   1           1.40        0.00         10.30
...               ...            ...         ...           ...
9994                1           2.70        0.00         12.30
9995                1           4.50        3.00         20.30
9996                1           5.59        0.00         22.30
9997                6           1.54        0.00          7.80
9998                1           5.80        4.45         26.75

[9999 rows x 4 columns]

In [186]:
df['tip_percentage'] = df['tip_amount'] / df['total_amount']
df

      passenger_count  trip_distance  tip_amount  total_amount  tip_percentage
0                   1           1.63        0.00         17.80        0.000000
1                   1           0.46        1.00          8.30        0.120482
2                   1           0.87        2.20         11.00        0.200000
3                   1           2.13        2.86         17.16        0.166667
4                   1           1.40        0.00         10.30        0.000000
...               ...            ...         ...           ...             ...
9994                1           2.70        0.00         12.30        0.000000
9995                1           4.50        3.00         20.30        0.147783
9996                1           5.59        0.00         22.30        0.000000
9997                6           1.54        0.00          7.80        0.000000
9998                1           5.80        4.45         26.75        0.166355

[9999 rows x 5 columns]

In [187]:
df.to_csv('taxi_tip.csv', sep='\t')

In [188]:
!head taxi_tip.csv

	passenger_count	trip_distance	tip_amount	total_amount	tip_percentage
0	1	1.63	0.0	17.8	0.0
1	1	0.46	1.0	8.3	0.12048192771084336
2	1	0.87	2.2	11.0	0.2
3	1	2.13	2.86	17.16	0.16666666666666666
4	1	1.4	0.0	10.3	0.0
5	1	1.4	1.75	10.55	0.16587677725118483
6	1	1.8	3.0	16.3	0.18404907975460122
7	4	11.9	15.0	73.84	0.20314192849404117
8	1	1.27	0.0	15.8	0.0

In [189]:
df = pd.read_csv('taxi_tip.csv', sep='\t')
df.head()

,Unnamed: 0,passenger_count,trip_distance,tip_amount,total_amount,tip_percentage
0,0,1,1.63,0.00,17.80,0.000000
1,1,1,0.46,1.00,8.30,0.120482
2,2,1,0.87,2.20,11.00,0.200000
3,3,1,2.13,2.86,17.16,0.166667
4,4,1,1.40,0.00,10.30,0.000000

In [192]:
# Read this all back in, and find the mean trip_distance where total_amount was > 50.

df.loc[
    df['total_amount'] > 50,    # row selector
    'trip_distance'     # column selector
].mean()

np.float64(15.13097966728281)

In [193]:

df['tip_percentage'].mean()

np.float64(0.09161173442485879)

In [194]:
df['tip_percentage'].median()

np.float64(0.1075268817204301)

# Loading Excel data

We can load in Excel data *but* Pandas doesn't know how to read from Excel files itself. So if you use `read_excel` to read an Excel file, and you get an error, read it! It will tell you what library you need to be installing in order for Excel loading to work!

In [196]:
filename = '/Users/reuven/Courses/Current/data/Strategic Wine Reserve.xlsx'

df = pd.read_excel(filename)

In [197]:
df.head()

,Type,Color,Category,Size,Currency,Value notes,Price,TotalQuantity,Quantity,Pending,...,Vineyard,Country,Region,SubRegion,Latitude,Longitude,Appellation,BeginConsume,EndConsume,CScore
0,White - Sparkling,White,Sparkling,1.5L,GBP,Blended price,0,13,13,0,...,Unknown,France,Champagne,Unknown,45.831944,-0.906667,Champagne,2017.0,2050.0,94.695652
1,Red,Red,Dry,750ml,GBP,Blended price,0,17,17,0,...,Unknown,France,Bordeaux,Mdoc,44.556187,-0.049405,Pauillac,2016.0,2060.0,95.792176
2,Red,Red,Dry,750ml,GBP,Blended price,0,2,2,0,...,Unknown,France,Bordeaux,Libournais,44.900829,-0.23123,Pomerol,1998.0,2012.0,93.826087
3,Red,Red,Dry,750ml,GBP,Blended price,0,13,13,0,...,Unknown,France,Burgundy,Cte de Nuits,47.17769,", 4.959523844023448",Echezeaux Grand Cru,2010.0,2050.0,93.644068
4,Red,Red,Dry,750ml,GBP,Blended price,0,17,17,0,...,Unknown,France,Bordeaux,Libournais,44.900829,-0.23123,Pomerol,2002.0,2013.0,94.400000

In [198]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 517 entries, 0 to 516
Data columns (total 27 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Type            517 non-null    str
 1   Color           517 non-null    str
 2   Category        517 non-null    str
 3   Size            517 non-null    str
 4   Currency        517 non-null    str
 5   Value notes     517 non-null    str
 6   Price           517 non-null    int64
 7   TotalQuantity   517 non-null    int64
 8   Quantity        517 non-null    int64
 9   Pending         517 non-null    int64
 10  Vintage         487 non-null    float64
 11  Wine            517 non-null    str
 12  Locale          517 non-null    str
 13  Producer        517 non-null    str
 14  Varietal        517 non-null    str
 15  MasterVarietal  517 non-null    str
 16  Designation     517 non-null    str
 17  Vineyard        517 non-null    str
 18  Country         517 non-null    str
 19  Region          517 non-null    str
 20  SubRegion       517 non-null    str
 21  Latitude        517 non-null    object
 22  Longitude       517 non-null    object
 23  Appellation     517 non-null    str
 24  BeginConsume    482 non-null    float64
 25  EndConsume      484 non-null    float64
 26  CScore          451 non-null    float64
dtypes: float64(4), int64(4), object(2), str(17)
memory usage: 213.3+ KB

In [201]:
# what is the mean price of a wine in the UK's strategic wine reserve

df['Quantity'].describe()

count    517.000000
mean      62.396518
std       57.052772
min        1.000000
25%       17.000000
50%       57.000000
75%       96.000000
max      720.000000
Name: Quantity, dtype: float64

In [205]:
# what wine do they have 720 bottles of?

df.loc[  df['Quantity'] == df['Quantity'].max() ].iloc[0]

Type                                      White
Color                                     White
Category                                    Dry
Size                                      750ml
Currency                                    GBP
Value notes                       Blended price
Price                                         0
TotalQuantity                               720
Quantity                                    720
Pending                                       0
Vintage                                  2023.0
Wine                        Chapel Down Bacchus
Locale            United Kingdom, England, Kent
Producer                            Chapel Down
Varietal                                Bacchus
MasterVarietal                          Bacchus
Designation                             Unknown
Vineyard                                Unknown
Country                          United Kingdom
Region                                  England
SubRegion                                  Kent
Latitude                              51.202993
Longitude                              0.716829
Appellation                             Unknown
BeginConsume                             2024.0
EndConsume                               2026.0
CScore                                     89.0
Name: 403, dtype: object

In [206]:
# What if the data is on the Internet?
# What if there is a CSV file that I want to load into a data frame?
# Do I need to download it, and then load it into Pandas?

# no! You can pass not only a filename to read_*, but also a URL!

taxi_speeds_filename = 'https://files.lerner.co.il/bw-152-taxi-speeds.csv'

taxi_speeds_df = pd.read_csv(taxi_speeds_filename)

In [207]:
taxi_speeds_df

          Month          Zone  Zonal Speed
0    10/01/2025           CBD         7.73
1    10/01/2025  CBD Adjacent        10.39
2    10/01/2025   Greater NYC        14.99
3    09/01/2025   Greater NYC        15.36
4    09/01/2025  CBD Adjacent        10.71
..          ...           ...          ...
214  11/01/2019           CBD         8.00
215  11/01/2019  CBD Adjacent        11.65
216  10/01/2019           CBD         7.98
217  10/01/2019  CBD Adjacent        11.82
218  10/01/2019   Greater NYC        16.88

[219 rows x 3 columns]

In [211]:
gdp_url = '/Users/reuven/Desktop/List of countries by GDP (nominal) - Wikipedia.html'

all_dfs = pd.read_html(gdp_url)  # we'll get a list of data frames, one for each table

In [212]:
len(all_dfs)

7

In [215]:
all_dfs[2]

,Country/Territory,IMF (2026)[6],World Bank (2024)[7],United Nations (2024)[8]
0,World,123584494,111326370,100834796
1,United States,31821293,28750956,29298000
2,China[n 1],20650754,18743803,18743802
3,Germany,5328184,4685593,4659929
4,Japan,4463634,4027598,4026211
...,...,...,...,...
217,Kiribati,343,308,343
218,Marshall Islands,332,290,281
219,Nauru,183,163,187
220,Montserrat,N/a,N/a,81
221,Tuvalu,61,62 (2023),56

# Next time

How to analyze our data!